Tekla.Structures.Drawing.LineTypeAttributes.#ctor(Tekla.Structures.Drawing.LineTypes,Tekla.Structures.Drawing.DrawingColors)
Creates a new line type attributes instance with the given line type and color.
lineType: The line type to be used.
color: The color to be used.